//時間割作成手順

//pass_data
//先生(数字)、授業(数字)、学級(数字)、使用教室(数字)、必要授業数、固定授業数、連続コマ数

let pass_lesson = [
  [
    [1, 1, 5, 6, 0, 3],
    [2, 2, 1, 1, 0, 1],
    [3, 2, 1, 1, 0, 1],
    [4, 2, 1, 3, 0, 1],
    [5, 3, 5, 3, 3, 3],
    [6, 4, 4, 3, 0, 3],
    [101, 0, 0, 9, 9, 3],
  ],
  [
    [1, 7, 6, 3, 3, 3],
    [2, 3, 7, 3, 3, 3],
    [3, 4, 4, 3, 0, 3],
    [4, 1, 2, 1, 1, 1],
    [5, 1, 2, 2, 2, 1],
    [6, 1, 6, 6, 0, 3],
    [201, 0, 0, 3, 6, 3],
    [202, 0, 0, 3, 3, 3],
  ],
  [
    [1, 6, 4, 9, 9, 3],
    [2, 6, 3, 3, 3, 3],
    [3, 5, 3, 6, 6, 3],
    [4, 5, 3, 6, 6, 3],
    [5, 1, 3, 2, 2, 1],
    [6, 1, 3, 1, 1, 1],
  ],
  [
    [1, 6, 4, 9, 9, 3],
    [2, 6, 3, 3, 3, 3],
    [3, 5, 3, 6, 6, 3],
    [4, 5, 3, 6, 6, 3],
  ],
];

let d = pass_lesson;
let pass_timetable = [
  [
    [, , , d[0][6], d[0][6], d[0][6]],
    [d[0][6], d[0][6], d[0][6], , , , ],
    [, , , d[0][6], d[0][6], d[0][6]],
    [, , , d[0][4], d[0][4], d[0][4]],
    [, , , , , , ],
  ],
  [
    [d[1][6], d[1][6], d[1][6], d[1][1], d[1][1], d[1][1]],
    [d[1][0], d[1][0], d[1][0], , , , ],
    [d[1][7], d[1][7], d[1][7], , , , ],
    [, , , , , , ],
    [d[1][6], d[1][6], d[1][6], d[1][3], d[1][4], d[1][4]],
  ],
  [
    [d[2][0], d[2][0], d[2][0], d[2][2], d[2][2], d[2][2]],
    [d[2][2], d[2][2], d[2][2], d[2][1], d[2][1], d[2][1]],
    [d[2][1], d[2][1], d[2][1], , , , ],
    [d[2][3], d[2][3], d[2][3], d[2][3], d[2][3], d[2][3]],
    [d[2][0], d[2][0], d[2][0], d[2][4], d[2][5], d[2][5]],
  ],
  [
    [d[3][0], d[3][0], d[3][0], d[3][2], d[3][2], d[3][2]],
    [d[3][2], d[3][2], d[3][2], d[3][1], d[3][1], d[3][1]],
    [d[3][1], d[3][1], d[3][1], , , , ],
    [d[3][3], d[3][3], d[3][3], d[3][3], d[3][3], d[3][3]],
    [d[3][0], d[3][0], d[3][0], , , , ],
  ],
];


let choice_lesson = [
  [
    [101, 1, 8, 2],
    [101, 2, 0, 8],
    [101, 3, 1, 9],
    [101, 4, 2, 1],
    [101, 5, 6, 4],
  ],
  [
    [201, 1, 8, 2],
    [201, 2, 6, 4],
    [202, 3, 8, 2],
    [202, 4, 6, 4],
  ],
];
console.log(pass_lesson);
console.log(pass_timetable);

let class_list = ["1年", "2年", "3年", "4年"];
let teacher_list = ["選択", "川越", "岩城", "吉岡", "町浦", "行本", "平川", "大野", "池田"];
let classroom_list = ["選択", "501", "503", "401", "701", "大原201", "大原203", "大原204", "スタジアム", "学生会館２Ｆ－Ｂ"];
let lesson_list = [
  ["ＪＡＶＡ", "一般教養", "ビジネス実務", "ＮＷ", "ＷＥＢ", "ＥＸＣＥＬ", "選択１"],
  ["ＤＢ", "ＨＰ", "ＷＯＲＤ", "一般教養", "就職実務", "ＪＡＶＡ", "選択１", "選択２"],
  ["システム開発", "開発演習", "プログラミング実習", "プログラミング演習", "一般教養", "就職実務"],
  ["システム開発", "開発演習", "プログラミング実習", "プログラミング演習"],
];
//let table = document.querySelectorAll("table");
//let col = "";
//for (let i = 0; i < pass_timetable.length; i++) {
//  for (let y = 0; y < pass_timetable[i].length; y++) {
//    for (let x = 0; x < pass_timetable[i][y].length; x++) {
//      if (pass_timetable[i][y][x] != undefined) {
//        if (pass_timetable[i][y][x][0] - 1 >= 100) {
//          col = "選択";
//        } else {
//          col = lesson_list[i][pass_timetable[i][y][x][0] - 1];
//        }
//        table[i].children[0].children[x].children[y].textContent = col;
//      }
//      //      table[i].children[0].children[y].children[x].textContent = col;
//    }
//  }
//}
